# MICROSOFT NEW MOVIE STUDIO.

## 1. Business Understanding.

#### a) SPECIFYING THE DATA ANALYTICS QUESTION.
Microsoft sees all the big companies creating original video content and they want to get in on the fun. They have decided to create a new movie studio, but they don’t know anything about creating movies. You are charged with exploring what types of films are currently doing the best at the box office. You must then translate those findings into actionable insights that the head of Microsoft's new movie studio can use to help decide what type of films to create.

#### b) PROBLEM STATEMENT.
Microsoft is interested in making a new movie studio but do not know how to go about it. This analysis aims at helping to make the right insights for the company to venture into.

#### c) DEFINING THE METRIC OF SUCCESS.
This project will be considered a success if it can yield at least 3 actionable recommendations that would help microsoft make business driven decisions on what movies to venture into by knowing which genres are the most popular and how to invest in them.
More than likely, these insights are all influenced ample knowledge following CRISPDM methodology.

#### d) MAIN OBJECTIVE.
To come up with actionable insights that would be implemented by Microsoft to make a new movie studio.

#### e) SPECIFIC OBJECTIVES.
###### .To find out which genres of movies are most popular.
###### .To find out the budget for investment.
###### .To find out which publishers and studios are most popular.

#### f) EXPERIMENTAL DESIGN
##### 1.Data Collection
##### 2.Read and check the data
##### 3.Cleaning the data
##### 4.Exploratory Data Analysis
##### 5.Conclusions and Recommendations

### g) Data Understanding.
The data used is contained in a folder with zippedData that has movie datasets from:
##### .im.db.zip:
#####    .movie_basics 
#####    .movie_ratings
##### .bom.movie_gross.csv.gz

## 2. Importing Libraries.

In [1]:
#Import necessary libraríes
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline
import warnings
warnings.filterwarnings('ignore')

## 3. Reading the Data.

In [2]:
# from bom movie gross
movie_gross= pd.read_csv('bom.movie_gross.csv.gz')
movie_gross.head()

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010

In [3]:
#from title basics.
title_basics = pd.read_csv('imdb.title.basics.csv.gz')
title_basics.head()

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"

In [4]:
#from ratings.
ratings = pd.read_csv('imdb.title.ratings.csv.gz')
ratings.head()

       tconst  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559
2   tt1042974            6.4        20
3   tt1043726            4.2     50352
4   tt1060240            6.5        21

In [5]:
movie_info= pd.read_csv('rt.movie_info.tsv.gz', delimiter='\t', encoding='latin1')
movie_info.head()

,id,synopsis,rating,genre,director,writer,theater_date,dvd_date,currency,box_office,runtime,studio
0,1,"This gritty, fast-paced, and innovative police...",R,Action and Adventure|Classics|Drama,William Friedkin,Ernest Tidyman,"Oct 9, 1971","Sep 25, 2001",NaN,NaN,104 minutes,NaN
1,3,"New York City, not-too-distant-future: Eric Pa...",R,Drama|Science Fiction and Fantasy,David Cronenberg,David Cronenberg|Don DeLillo,"Aug 17, 2012","Jan 1, 2013",$,"600,000",108 minutes,Entertainment One
2,5,Illeana Douglas delivers a superb performance ...,R,Drama|Musical and Performing Arts,Allison Anders,Allison Anders,"Sep 13, 1996","Apr 18, 2000",NaN,NaN,116 minutes,NaN
3,6,Michael Douglas runs afoul of a treacherous su...,R,Drama|Mystery and Suspense,Barry Levinson,Paul Attanasio|Michael Crichton,"Dec 9, 1994","Aug 27, 1997",NaN,NaN,128 minutes,NaN
4,7,NaN,NR,Drama|Romance,Rodney Bennett,Giles Cooper,NaN,NaN,NaN,NaN,200 minutes,NaN

In [6]:
# from movie budgets.
movie_budgets= pd.read_csv('tn.movie_budgets.csv.gz')
movie_budgets.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

In [7]:
name_basics= pd.read_csv('imdb.name.basics.csv.gz')
name_basics.head()

,nconst,primary_name,birth_year,death_year,primary_profession,known_for_titles
0,nm0061671,Mary Ellen Bauder,NaN,NaN,"miscellaneous,production_manager,producer","tt0837562,tt2398241,tt0844471,tt0118553"
1,nm0061865,Joseph Bauer,NaN,NaN,"composer,music_department,sound_department","tt0896534,tt6791238,tt0287072,tt1682940"
2,nm0062070,Bruce Baum,NaN,NaN,"miscellaneous,actor,writer","tt1470654,tt0363631,tt0104030,tt0102898"
3,nm0062195,Axel Baumann,NaN,NaN,"camera_department,cinematographer,art_department","tt0114371,tt2004304,tt1618448,tt1224387"
4,nm0062798,Pete Baxter,NaN,NaN,"production_designer,art_department,set_decorator","tt0452644,tt0452692,tt3458030,tt2178256"

In [8]:
movies_popularity= pd.read_csv('tmdb.movies.csv.gz')
movies_popularity.head()

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610
2,2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368
3,3,"[16, 35, 10751]",862,en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174
4,4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186

## 4.DATA WRANGLING.

### 4.1 DROPPING COLUMNS.

In [9]:
# from title basics.
title_basics_new = title_basics[['tconst','primary_title','genres']]
title_basics_new.head()

      tconst                    primary_title                genres
0  tt0063540                        Sunghursh    Action,Crime,Drama
1  tt0066787  One Day Before the Rainy Season       Biography,Drama
2  tt0069049       The Other Side of the Wind                 Drama
3  tt0069204                  Sabse Bada Sukh          Comedy,Drama
4  tt0100275         The Wandering Soap Opera  Comedy,Drama,Fantasy

In [10]:
#from movie_info
movie_info_new= movie_info[['id','writer','director']]
movie_info_new.head()

   id                           writer          director
0   1                   Ernest Tidyman  William Friedkin
1   3     David Cronenberg|Don DeLillo  David Cronenberg
2   5                   Allison Anders    Allison Anders
3   6  Paul Attanasio|Michael Crichton    Barry Levinson
4   7                     Giles Cooper    Rodney Bennett

In [11]:
# from movie budgets.
movie_budgets_new= movie_budgets[['id','production_budget','domestic_gross','worldwide_gross']]
movie_budgets_new.head()

   id production_budget domestic_gross worldwide_gross
0   1      $425,000,000   $760,507,625  $2,776,345,279
1   2      $410,600,000   $241,063,875  $1,045,663,875
2   3      $350,000,000    $42,762,350    $149,762,350
3   4      $330,600,000   $459,005,868  $1,403,013,963
4   5      $317,000,000   $620,181,382  $1,316,721,747

In [12]:
#from name basics.
name_basics_new= name_basics[['primary_name','known_for_titles']]
name_basics_new.head()

        primary_name                         known_for_titles
0  Mary Ellen Bauder  tt0837562,tt2398241,tt0844471,tt0118553
1       Joseph Bauer  tt0896534,tt6791238,tt0287072,tt1682940
2         Bruce Baum  tt1470654,tt0363631,tt0104030,tt0102898
3       Axel Baumann  tt0114371,tt2004304,tt1618448,tt1224387
4        Pete Baxter  tt0452644,tt0452692,tt3458030,tt2178256

In [13]:
# from movie popularity.
movies_popularity_new= movies_popularity[['original_title','vote_average','vote_count','popularity']]
movies_popularity_new.head()

,original_title,vote_average,vote_count,popularity
0,Harry Potter and the Deathly Hallows: Part 1,7.7,10788,33.533
1,How to Train Your Dragon,7.7,7610,28.734
2,Iron Man 2,6.8,12368,28.515
3,Toy Story,7.9,10174,28.005
4,Inception,8.3,22186,27.920

In [14]:
# from movie bom.
movie_gross_new= movie_gross[['title','domestic_gross','foreign_gross','year']]
movie_gross_new.head()

,title,domestic_gross,foreign_gross,year
0,Toy Story 3,415000000.0,652000000,2010
1,Alice in Wonderland (2010),334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,296000000.0,664300000,2010
3,Inception,292600000.0,535700000,2010
4,Shrek Forever After,238700000.0,513900000,2010

### 4.2. Checking for null values.

In [15]:
title_basics_new.isna().sum()

tconst              0
primary_title       0
genres           5408
dtype: int64

In [16]:
title_basics_new.describe()

           tconst primary_title       genres
count      146144        146144       140736
unique     146144        136071         1085
top     tt0063540          Home  Documentary
freq            1            24        32185

In [17]:
title_basics_new= title_basics_new.dropna(subset=['genres'])
title_basics_new.head()

      tconst                    primary_title                genres
0  tt0063540                        Sunghursh    Action,Crime,Drama
1  tt0066787  One Day Before the Rainy Season       Biography,Drama
2  tt0069049       The Other Side of the Wind                 Drama
3  tt0069204                  Sabse Bada Sukh          Comedy,Drama
4  tt0100275         The Wandering Soap Opera  Comedy,Drama,Fantasy

In [18]:
title_basics_new.isna().sum()

tconst           0
primary_title    0
genres           0
dtype: int64

In [19]:
title_basics_new.head()

      tconst                    primary_title                genres
0  tt0063540                        Sunghursh    Action,Crime,Drama
1  tt0066787  One Day Before the Rainy Season       Biography,Drama
2  tt0069049       The Other Side of the Wind                 Drama
3  tt0069204                  Sabse Bada Sukh          Comedy,Drama
4  tt0100275         The Wandering Soap Opera  Comedy,Drama,Fantasy

In [20]:
title_basics_new.shape

(140736, 3)

In [21]:
# renaming the title column.
title_basics_new= title_basics_new.rename(columns = {'primary_title':'title'})

In [22]:
title_basics_new.head()

      tconst                            title                genres
0  tt0063540                        Sunghursh    Action,Crime,Drama
1  tt0066787  One Day Before the Rainy Season       Biography,Drama
2  tt0069049       The Other Side of the Wind                 Drama
3  tt0069204                  Sabse Bada Sukh          Comedy,Drama
4  tt0100275         The Wandering Soap Opera  Comedy,Drama,Fantasy

In [23]:
#from movie info.
movie_info_new.isna().sum()

id            0
writer      449
director    199
dtype: int64

In [24]:
movie_info_new= movie_info_new.dropna(subset=['writer'])
movie_info_new.head()

   id                           writer          director
0   1                   Ernest Tidyman  William Friedkin
1   3     David Cronenberg|Don DeLillo  David Cronenberg
2   5                   Allison Anders    Allison Anders
3   6  Paul Attanasio|Michael Crichton    Barry Levinson
4   7                     Giles Cooper    Rodney Bennett

In [25]:
movie_info_new.dtypes

id           int64
writer      object
director    object
dtype: object

In [26]:
movie_info_new.isna().sum()

id           0
writer       0
director    68
dtype: int64

In [27]:
movie_info_new= movie_info_new.dropna(subset=['director'])
movie_info_new.head()

   id                           writer          director
0   1                   Ernest Tidyman  William Friedkin
1   3     David Cronenberg|Don DeLillo  David Cronenberg
2   5                   Allison Anders    Allison Anders
3   6  Paul Attanasio|Michael Crichton    Barry Levinson
4   7                     Giles Cooper    Rodney Bennett

In [28]:
movie_info_new.isna().sum()

id          0
writer      0
director    0
dtype: int64

In [29]:
movie_info_new.shape

(1043, 3)

In [30]:
# from movie_budgets
movie_budgets_new.isna().sum()

id                   0
production_budget    0
domestic_gross       0
worldwide_gross      0
dtype: int64

In [31]:
movie_budgets_new.shape

(5782, 4)

In [32]:
movie_budgets_new.head()

   id production_budget domestic_gross worldwide_gross
0   1      $425,000,000   $760,507,625  $2,776,345,279
1   2      $410,600,000   $241,063,875  $1,045,663,875
2   3      $350,000,000    $42,762,350    $149,762,350
3   4      $330,600,000   $459,005,868  $1,403,013,963
4   5      $317,000,000   $620,181,382  $1,316,721,747

In [33]:
movie_budgets_new['production_budget'] = movie_budgets_new['production_budget'].str.replace('$',"")
movie_budgets_new['domestic_gross'] = movie_budgets_new['domestic_gross'].str.replace('$',"")
movie_budgets_new['worldwide_gross'] = movie_budgets_new['worldwide_gross'].str.replace('$',"")

In [34]:
movie_budgets_new['production_budget'] = movie_budgets_new['production_budget'].str.replace(',',"")
movie_budgets_new['domestic_gross'] = movie_budgets_new['domestic_gross'].str.replace(',',"")
movie_budgets_new['worldwide_gross'] = movie_budgets_new['worldwide_gross'].str.replace(',',"")

In [35]:
movie_budgets_new.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 4 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 5782 non-null   int64
 1   production_budget  5782 non-null   object
 2   domestic_gross     5782 non-null   object
 3   worldwide_gross    5782 non-null   object
dtypes: int64(1), object(3)
memory usage: 180.8+ KB

In [36]:
movie_budgets_new['production_budget']= movie_budgets_new['production_budget'].astype(float)

In [37]:
movie_budgets_new['domestic_gross']= movie_budgets_new['domestic_gross'].astype(float)

In [38]:
movie_budgets_new['worldwide_gross']= movie_budgets_new['worldwide_gross'].astype(float)

In [39]:
movie_budgets_new.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 4 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 5782 non-null   int64
 1   production_budget  5782 non-null   float64
 2   domestic_gross     5782 non-null   float64
 3   worldwide_gross    5782 non-null   float64
dtypes: float64(3), int64(1)
memory usage: 180.8 KB

In [40]:
movie_budgets_new.head()

   id  production_budget  domestic_gross  worldwide_gross
0   1        425000000.0     760507625.0     2.776345e+09
1   2        410600000.0     241063875.0     1.045664e+09
2   3        350000000.0      42762350.0     1.497624e+08
3   4        330600000.0     459005868.0     1.403014e+09
4   5        317000000.0     620181382.0     1.316722e+09

In [41]:
#from name basics.
name_basics_new.isna().sum()

primary_name            0
known_for_titles    30204
dtype: int64

In [42]:
name_basics_new.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 606648 entries, 0 to 606647
Data columns (total 2 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   primary_name      606648 non-null  object
 1   known_for_titles  576444 non-null  object
dtypes: object(2)
memory usage: 9.3+ MB

In [43]:
name_basics_new.describe()

         primary_name known_for_titles
count          606648           576444
unique         577203           482207
top     Michael Brown        tt4773466
freq               16               45

In [44]:
name_basics_new= name_basics_new.dropna(subset = ['known_for_titles'])
name_basics_new.head()

        primary_name                         known_for_titles
0  Mary Ellen Bauder  tt0837562,tt2398241,tt0844471,tt0118553
1       Joseph Bauer  tt0896534,tt6791238,tt0287072,tt1682940
2         Bruce Baum  tt1470654,tt0363631,tt0104030,tt0102898
3       Axel Baumann  tt0114371,tt2004304,tt1618448,tt1224387
4        Pete Baxter  tt0452644,tt0452692,tt3458030,tt2178256

In [45]:
name_basics_new.describe()

       primary_name known_for_titles
count        576444           576444
unique       549966           482207
top     James Brown        tt4773466
freq             16               45

In [46]:
name_basics_new.isna().sum()

primary_name        0
known_for_titles    0
dtype: int64

In [47]:
# renaming the primary_name column
name_basics_new= name_basics_new.rename(columns = {'primary_name':'writer'})
name_basics_new.head()

              writer                         known_for_titles
0  Mary Ellen Bauder  tt0837562,tt2398241,tt0844471,tt0118553
1       Joseph Bauer  tt0896534,tt6791238,tt0287072,tt1682940
2         Bruce Baum  tt1470654,tt0363631,tt0104030,tt0102898
3       Axel Baumann  tt0114371,tt2004304,tt1618448,tt1224387
4        Pete Baxter  tt0452644,tt0452692,tt3458030,tt2178256

In [48]:
#from movie_popularity.
movies_popularity_new.isna().sum()

original_title    0
vote_average      0
vote_count        0
popularity        0
dtype: int64

In [49]:
movies_popularity_new.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26517 entries, 0 to 26516
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   original_title  26517 non-null  object
 1   vote_average    26517 non-null  float64
 2   vote_count      26517 non-null  int64
 3   popularity      26517 non-null  float64
dtypes: float64(2), int64(1), object(1)
memory usage: 828.8+ KB

In [50]:
movies_popularity_new.describe()

       vote_average    vote_count    popularity
count  26517.000000  26517.000000  26517.000000
mean       5.991281    194.224837      3.130912
std        1.852946    960.961095      4.355229
min        0.000000      1.000000      0.600000
25%        5.000000      2.000000      0.600000
50%        6.000000      5.000000      1.374000
75%        7.000000     28.000000      3.694000
max       10.000000  22186.000000     80.773000

In [51]:
# renaming the title column.
movies_popularity_new= movies_popularity_new.rename(columns = {'original_title':'title'})
movies_popularity_new.head()

,title,vote_average,vote_count,popularity
0,Harry Potter and the Deathly Hallows: Part 1,7.7,10788,33.533
1,How to Train Your Dragon,7.7,7610,28.734
2,Iron Man 2,6.8,12368,28.515
3,Toy Story,7.9,10174,28.005
4,Inception,8.3,22186,27.920

In [52]:
#from bom movie
movie_gross_new.isna().sum()

title                0
domestic_gross      28
foreign_gross     1350
year                 0
dtype: int64

In [53]:
movie_gross_new.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3387 entries, 0 to 3386
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           3387 non-null   object
 1   domestic_gross  3359 non-null   float64
 2   foreign_gross   2037 non-null   object
 3   year            3387 non-null   int64
dtypes: float64(1), int64(1), object(2)
memory usage: 106.0+ KB

In [54]:
movie_gross_new.describe()

       domestic_gross         year
count    3.359000e+03  3387.000000
mean     2.874585e+07  2013.958075
std      6.698250e+07     2.478141
min      1.000000e+02  2010.000000
25%      1.200000e+05  2012.000000
50%      1.400000e+06  2014.000000
75%      2.790000e+07  2016.000000
max      9.367000e+08  2018.000000

In [55]:
movie_gross_new['foreign_gross'].isna().sum()

1350

In [56]:
movie_gross_new['domestic_gross'].isna().sum()

28

In [57]:
# Fill missing values with the mode in 'domestic_gross' column
domestic_mode = movie_gross_new['domestic_gross'].mode().values[0]
movie_gross_new['domestic_gross'].fillna(domestic_mode, inplace=True)

# Fill missing values with the mode in 'foreign_gross' column
foreign_mode = movie_gross_new['foreign_gross'].mode().values[0]
movie_gross_new['foreign_gross'].fillna(foreign_mode, inplace=True)

In [58]:
movie_gross_new.head()

,title,domestic_gross,foreign_gross,year
0,Toy Story 3,415000000.0,652000000,2010
1,Alice in Wonderland (2010),334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,296000000.0,664300000,2010
3,Inception,292600000.0,535700000,2010
4,Shrek Forever After,238700000.0,513900000,2010

In [59]:
movie_gross_new.isna().sum()

title             0
domestic_gross    0
foreign_gross     0
year              0
dtype: int64

In [60]:
# Convert 'domestic_gross' column to string
movie_gross_new['domestic_gross'] = movie_gross_new['domestic_gross'].astype(str)

# Convert 'foreign_gross' column to string
movie_gross_new['foreign_gross'] = movie_gross_new['foreign_gross'].astype(str)

In [61]:
# Remove commas from 'domestic_gross' column values and convert to float
movie_gross_new['domestic_gross'] = movie_gross_new['domestic_gross'].str.replace(',', '').astype(float)

# Remove commas from 'foreign_gross' column values and convert to float
movie_gross_new['foreign_gross'] = movie_gross_new['foreign_gross'].str.replace(',', '').astype(float)

In [62]:
movie_gross_new.head()

,title,domestic_gross,foreign_gross,year
0,Toy Story 3,415000000.0,652000000.0,2010
1,Alice in Wonderland (2010),334200000.0,691300000.0,2010
2,Harry Potter and the Deathly Hallows Part 1,296000000.0,664300000.0,2010
3,Inception,292600000.0,535700000.0,2010
4,Shrek Forever After,238700000.0,513900000.0,2010

In [63]:
# from ratings.
ratings.isna().sum()

tconst           0
averagerating    0
numvotes         0
dtype: int64

## 4.3 Merging the datasets.

In [64]:
Data_1 = pd.merge(movie_budgets_new, movie_gross_new, on='domestic_gross', how= 'inner')
Data_1.head()

,id,production_budget,domestic_gross,worldwide_gross,title,foreign_gross,year
0,42,110000000.0,3100000.0,3100000.0,Chloe,8600000.0,2010
1,42,110000000.0,3100000.0,3100000.0,Zindagi Na Milegi Dobara,1200000.0,2011
2,42,110000000.0,3100000.0,3100000.0,Raiders of the Lost Ark (IMAX),1200000.0,2012
3,42,110000000.0,3100000.0,3100000.0,Celeste and Jesse Forever,1200000.0,2012
4,42,110000000.0,3100000.0,3100000.0,Rosewater,1200000.0,2014

In [65]:
Data_2 = pd.merge(title_basics_new, movies_popularity_new, on= 'title', how= 'inner')
Data_2.head()

,tconst,title,genres,vote_average,vote_count,popularity
0,tt0069049,The Other Side of the Wind,Drama,7.0,64,9.800
1,tt0112502,Bigfoot,"Horror,Thriller",2.9,26,2.813
2,tt4503112,Bigfoot,"Action,Horror",2.9,26,2.813
3,tt9181914,Bigfoot,"Animation,Family",2.9,26,2.813
4,tt0192528,Heaven & Hell,Drama,7.5,2,0.600

In [66]:
Data_3 = pd.merge(title_basics_new, ratings, on ='tconst', how= 'inner')
Data_3.head()

,tconst,title,genres,averagerating,numvotes
0,tt0063540,Sunghursh,"Action,Crime,Drama",7.0,77
1,tt0066787,One Day Before the Rainy Season,"Biography,Drama",7.2,43
2,tt0069049,The Other Side of the Wind,Drama,6.9,4517
3,tt0069204,Sabse Bada Sukh,"Comedy,Drama",6.1,13
4,tt0100275,The Wandering Soap Opera,"Comedy,Drama,Fantasy",6.5,119

In [67]:
Data_4 = pd.merge(name_basics_new, movie_info_new, on= 'writer', how= 'inner')
Data_4.head()

,writer,known_for_titles,id,director
0,Charles Burnett,"tt0087763,tt0076263,tt0212772,tt0100791",797,Charles Burnett
1,Derek Cianfrance,"tt0176573,tt1120985,tt1817273,tt2547584",210,Derek Cianfrance
2,Roman Coppola,"tt0432283,tt0078788,tt1748122,tt0838221",961,Roman Coppola
3,Matt Johnson,"tt2488496,tt0113492,tt1837574,tt0112950",1707,John Stockwell
4,Matt Johnson,"tt2401097,tt0378109,tt0329691,tt0245481",1707,John Stockwell